{
    "intents": [
        {
            "tag": "greetings",
            "patterns": [
                "Hi",
                "hey",
                "good day",
                "How are you",
                "Is anyone there?",
                "Hello",
                "Good day",
                "Whats up",
                "How's it going?"
            ],
            "responces": [
                "Hello!",
                "Good to see you again!",
                "Hi there, how can I help?",
                "What can I do for you?",
                "Hey there, how can I help?",
                "Hello, thanks for visiting",
                "Hi there, how can I help?"
            ]
        },
        {
            "tag": "farewell",
            "patterns": [
                "Goodbye",
                "See you later",
                "Thanks, bye",
                "I'm leaving now",
                "Catch you later",
                "Goodbye for now",
                "I have to go",
                "I'll be back later",
                "Talk to you later"
            ],
            "responces": [
                "Goodbye!",
                "See you later!",
                "Thanks for visiting, have a great day!",
                "It was nice talking to you, have a great day!",
                "Catch you later, take care!",
                "Goodbye for now, have a great day!",
                "I'll be here when you come back, take care!",
                "Talk to you later, have a great day!"
            ]
        },
        {
            "tag": "help",
            "patterns": [
                "Can you help me",
                "I need help",
                "Can you assist me",
                "How do I",
                "I don't understand",
                "What do I do",
                "What is the process for",
                "I am unsure how to"
            ],
            "responces": [
                "Of course, what do you need help with?",
                "I'll do my best to assist you. What do you need help with?",
                "Sure, how can I help you?",
                "I'd be happy to help. What do you need assistance with?",
                "I'm here to help. What do you need help understanding?",
                "I'll try my best to help. What do you need help with?",
                "I'm here to assist you. What do you need help with?",
                "I'll do my best to assist you. What do you need help understanding?"
            ]
        },
        {
            "tag": "about",
            "patterns": [
                "What is this",
                "Can you tell me about this",
                "What does this do",
                "What is the purpose of this",
                "Can you explain this",
                "I'm not sure what this is",
                "What am I looking at",
                "What does this mean"
            ],
            "responces": [
                "This is a chatbot designed to assist you with various tasks. Is there something specific you need help with?",
                "I can tell you about this chatbot and its capabilities. What would you like to know?",
                "This chatbot is designed to assist users with various tasks. Is there something specific you would like to know?",
                "This chatbot is designed to help users with various tasks. Is there something specific you need help with?",
                "This chatbot is designed to assist users with various tasks. Is there something specific you would like to know?",
                "This chatbot is designed to help users with various tasks. Is there something specific you need help with?",
                "This chatbot is designed to assist users with various tasks. Is there something specific you would like to know?",
                "This chatbot is designed to help users with various tasks. Is there something specific you need help with?"
            ]
        },
        {
            "tag": "product_inquiry",
            "patterns": [
                "What products do you have",
                "Can you show me your products",
                "I'm looking for a specific product",
                "Do you have this product",
                "What are my options for products",
                "Can you give me more information about a product",
                "I'm interested in purchasing a product",
                "Can you recommend a product for me"
            ],
            "responces": [
                "We have a wide variety of products available. Can you please specify what you're looking for?",
                "Sure, please visit our website to see a list of our products. Is there a specific product you're interested in?",
                "Please visit our website to see a list of our products, or let me know what you're looking for and I can check for availability.",
                "Please provide me with the name or product code and I will check if it's available",
                "We have a variety of options available. Can you please let me know what you're looking for specifically?",
                "I'd be happy to give you more information about one of our products. Can you please let me know which product you're interested in?",
                "Please visit our website to see a list of our products and their prices, or let me know what you're looking for and I can give you pricing information.",
                "I'd be happy to recommend a product for you. Can you please let me know what you're looking for and your budget?"
            ]
        },
        {
            "tag": "customer_service",
            "patterns": [
                "I have a complaint",
                "I need to file a complaint",
                "I am not satisfied with my purchase",
                "I want to speak to a representative",
                "I need to speak to customer service",
                "I need assistance with my account",
                "I have an issue with my account",
                "I need help resolving a problem"
            ],
            "responces": [
                "I'm sorry to hear that you have a complaint. Can you please provide more information on the issue?",
                "We take all complaints seriously. Can you please provide more information on the issue you would like to file?",
                "I'm sorry to hear that you are not satisfied with your purchase. Can you please provide more information on the issue?",
                "I'd be happy to connect you with a customer service representative. Can you please provide me with your contact information?",
                "Our customer service team is here to assist you. Can you please provide me with more information on the issue you are facing?",
                "I can help you with your account. Can you please provide me with your account information?",
                "I'm sorry to hear that you are having an issue with your account. Can you please provide me with your account information?",
                "I'll do my best to help you resolve any problems you are facing. Can you please provide more information on the issue?"
            ]
        },
        {
            "tag": "customer_support",
            "patterns": [
                "How can I contact customer support",
                "What is the customer support phone number",
                "How do I get help with my account",
                "Can you give me customer support email",
                "I need customer support",
                "Can you give me customer support hours",
                "What is the customer support address",
                "Can you give me customer support website"
            ],
            "responces": [
                "You can contact customer support by phone, email, or through our website. Would you like me to provide you with the specific contact information?",
                "The customer support phone number is 555-555-5555. Is there anything else I can help you with?",
                "You can get help with your account by contacting customer support through phone, email or through our website. Can I provide you with the specific contact information?",
                "The customer support email is support@company.com. Is there anything else I can help you with?",
                "Our customer support team is here to assist you. Can you please let me know how I can help you?",
                "Customer support is available from 8am to 8pm EST. Is there anything else I can help you with?",
                "The customer support address is 1234 Example St. Is there anything else I can help you with?",
                "The customer support website is www.company.com/support. Is there anything else I can help you with?"
            ]
        },
        {
            "tag": "feedback",
            "patterns": [
            "Can you give me a feedback",
            "I want to give feedback",
            "Can you tell me how I did",
            "Can you give me your opinion",
            "Can you rate my performance",
            "How was my performance",
            "Can you tell me how I can improve",
            "I want to know how I can do better"
            ],
            "responces": [
            "I'd be happy to give you feedback. Can you please tell me what area you would like me to focus on?",
            "I appreciate your willingness to give feedback. Can you please tell me what area you would like me to focus on?",
            "I'd be happy to give you my opinion. Can you please tell me what area you would like me to focus on?",
            "I'll rate your performance as outstanding. Is there anything specific you would like me to comment on?",
            "I'm sorry, as a language model AI, I'm not able to rate your performance but I'm happy to help you in any way I can",
            "I'd be happy to tell you how you can improve. Can you please tell me what area you would like me to focus on?",
            "I'd be happy to give you suggestions on how to improve. Can you please tell me what area you would like me to focus on?",
            "I'd be happy to give you advice on how to do better. Can you please tell me what area you would like me to focus on?"
            ]
            },
            {
            "tag": "suggestions",
            "patterns": [
            "Can you suggest something",
            "Can you give me a suggestion",
            "I'm looking for suggestions",
            "Can you recommend something",
            "What do you suggest",
            "I want your opinion",
            "What would you do",
            "Can you give me advice"
            ],
            "responces": [
            "I'd be happy to give you a suggestion. Can you please give me more information on what you're looking for?",
            "Sure, can you please give me more information on what you're looking for?",
            "I'd be happy to give you some suggestions. Can you please give me more information on what you're looking for?",
            "I'd be happy to recommend something. Can you please give me more information on what you're looking for?",
            "Based on the information you've provided, I suggest you consider option X. Is there anything else I can help you with?",
            "I'd be happy to give you my opinion. Can you please give me more information on what you're looking for?",
            "Based on the information you've provided, I would do X. Is there anything else I can help you with?",
            "I'd be happy to give you advice. Can you please give me more information on what you're looking for?"
            ]
            }
    ]
}